Added mermaid diagram instead of ascii one
